Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 維天之命，於穆不已。 於乎不顯，文王之德之純。
en: The ordinances of Heaven,— How deep are they and unintermitting! And oh! how illustrious Was the singleness of the virtue of king Wăn!

source: 假以溢我，我其收之。 駿惠我文王，曾孫篤之。
en: How does he (now) show his kindness? We will receive it, Striving to be in accord with him, our ​king Wăn; And may his remotest descendant be abundantly the same!

source: 維清緝熙，文王之典。 肇禋。迄用有成，維周之禎。
en: Clear and to be preserved bright, Are the statutes of king Wăn. From the first sacrifice (to him), Till now when they have issued in our complete state, They have been the happy omen of (the fortunes of) Kâu.

source: 烈文辟公，錫茲祉福。惠我無疆，子孫保之。 無封靡于爾邦，維王其崇之。念茲戎功，繼序其皇之。 無競維人，四方其訓之。不顯維德，百辟其刑之。 於乎前王不忘。
en: Ye, brilliant and accomplished princes, Have conferred on me this happiness. Your favours to me are without limit, And my descendants will preserve (the fruits of) them. Be not mercenary nor extravagant in your states, And the king will honour you. Thinking of this ​great service, He will enlarge the dignity of your successors. What is most powerful is the being the man:— Its influence will be felt throughout your states. What is most distinguished is the being virtuous:— It will secure the imitation of all the princes. Ah! the former kings cannot be forgotten!

source: 天作高山，大王荒之。 彼作矣，文王康之。 彼徂矣，岐有夷之行。 子孫保之。
en: Heaven made the lofty hill, And king Thâi brought (the country about) it under cultivation. He made the commencement with it, And king Wăn tranquilly (carried on the work), (Till) that rugged (mount) Khî Had level roads leading to it. May their descendants ever preserve it!

source: 昊天有成命，二后受之。 成王不敢康，夙夜基命宥密。 於緝熙！單厥心。肆其靖之。
en: Heaven made its determinate appointment, Which our two sovereigns received. King Khăng did not dare to rest idly in it, But night and day enlarged ​its foundations by his deep and silent virtue. How did he continue and glorify (his heritage), Exerting all his heart, And so securing its tranquillity!

source: 我將我享，維羊維牛，維天其右之。 儀式刑文王之典，日靖四方。 伊嘏文王，既右饗之。 我其夙夜，畏天之威，于時保之。
en: I have brought my offerings, A ram and a bull. May Heaven accept them! I imitate and follow and observe the statutes of king Wăn, Seeking daily to secure the tranquillity of the kingdom. King Wăn, the Blesser, has descended on the right, and accepted (the offerings). Do I not, night and day, Revere the majesty of Heaven, Thus to preserve (its favour)?

source: 時邁其邦，昊天其子之。 實右序有周，薄言震之，莫不震疊。 懷柔百神，及河喬嶽。允王維后。 明昭有周，式序在位。 載戢干戈，載櫜弓矢。 我求懿德，肆于時夏。 允王保之。
en: Now is he making a progress through his states; May Heaven deal with him as its son! Truly are the honour and succession come from it to the House of Kâu. To his movements All respond with tremulous awe. He has attracted and given rest to all spiritual beings, Even to (the spirits of) the Ho and the highest hills. Truly is the king our sovereign lord. Brilliant and illustrious is the House of Kâu. He has regulated the positions of the princes; He has called in shields and spears; He has returned to their cases bows and arrows. I will cultivate admirable virtue, And display it throughout these great regions. Truly will the king preserve the appointment.

source: 執競武王，無競維烈，不顯成康，上帝是皇。自彼成康，奄有四方。 斤斤其明！鐘鼓喤喤，磬筦將將，降福穰穰，降福簡簡，威儀反反。 既醉既飽，福祿來反。
en: The arm of king Wû was full of strength; Irresistible was his ardour. Greatly illustrious were Khăng and Khang, Kinged by God. When we consider how Khăng and Khang Grandly held all within the four quarters (of the kingdom), How penetrating was their intelligence! The bells and drums sound in harmony; The sounding-stones and flutes blend their notes; Abundant blessing is sent down. Blessing is sent down in large measure. Careful and exact is all our deportment; We have drunk, and we have eaten, to the full; Our happiness and dignity will be prolonged.

source: 思文后稷，克配彼天。立我烝民，莫匪爾極。 貽我來牟，帝命率育，無此疆爾界，陳常于時夏。
en: O accomplished Hâu-kî, Thou didst prove thyself the correlate of Heaven. Thou didst give grain-food to our multitudes:— The immense gift of thy goodness. Thou didst confer on us the wheat and the barley, Which God appointed for the nourishment of all. And without distinction of territory or boundary, The rules of social duty were diffused throughout these great regions.

source: 嗟嗟臣工，敬爾在公。王釐爾成，來咨來茹。 嗟嗟保介，維莫之春，亦又何求？如何新畬？
en: Ah! ah! ministers and officers, Reverently attend to your public duties. The king has given you perfect rules;— Consult about them, and consider them.

source: 於皇來牟，將受厥明。明昭上帝，迄用康年。 命我衆人，庤乃錢鎛。奄觀銍艾。
en: Ah! ah! ye assistants, It is now the end of ​spring; And what have ye to seek for? (Only) how to manage the new fields and those of the third year. How beautiful are the wheat and the barley! The bright and glorious God Will in them give us a good year. Order all our men To be provided with their spuds and hoes:— Anon we shall see the sickles at work.

source: 噫嘻成王，既昭假爾，率時農夫，播厥百穀。 駿發爾私，終三十里，亦服爾耕，十千維耦。
en: Oh! yes, king Khăng Brightly brought himself near. Lead your husbandmen To sow their various kinds of grain, Going vigorously to work ​on your private fields, All over the thirty lî. Attend to your ploughing, With your ten thousand men all in pairs.

source: 振鷺于飛，于彼西雝。我客戾止，亦有斯容。
en: A flock of egrets is flying, About the marsh there in the west. My visitors came, With an (elegant) carriage like those birds.

source: 在彼無惡，在此無斁。庶幾夙夜，以永終譽。
en: There, (in their states), not disliked, Here, (in Kâu), never tired of;— They are sure, day and night, To perpetuate their fame.

source: 豐年多黍多稌，亦有高廩，萬億及秭。 為酒為醴，烝畀祖妣，以洽百禮，降福孔皆。
en: Abundant is the year with much millet and much rice; And we have our high granaries, With myriads, and hundreds of thousands, and millions (of measures in them); For spirits and sweet spirits, To present to our forefathers, male and female, And to supply all our ceremonies. The blessings sent down on us are of every kind.

source: 有瞽有瞽，在周之庭。設業設虡，崇牙樹羽。應田縣鼓，鞉磬柷圉。 既備乃奏，簫管備舉。喤喤厥聲，肅雝和鳴，先祖是聽。 我客戾止，永觀厥成。
en: There are the blind musicians; there are the blind musicians; In the court of (the temple of) Kâu.

source: 猗與漆沮，潛有多魚。 有鱣有鮪，鰷鱨鰋鯉。 以享以祀，以介景福。
en: Oh! in the Khî and the Khü, There are many fish in the warrens;— Sturgeons, large and snouted, Thryssas, yellow-jaws, mud-fish, and carp;— For offerings, for sacrifice, That our bright happiness may be increased.

source: 有來雝雝，至止肅肅。相維辟公，天子穆穆。於薦廣牡，相予肆祀。
en: They come full of harmony; They are here in all gravity;— The princes assisting, While the Son of Heaven looks profound.

source: 假哉皇考，綏予孝子。宣哲維人，文武維后。燕及皇天，克昌厥後。
en: (He says), 'While I present (this) noble bull, And they assist me in setting forth the sacrifice, O great and august Father, Comfort me, your filial son.

source: 綏我眉壽，介以繁祉。既右烈考，亦右文母。
en: 'With penetrating wisdom thou didst play the man, A sovereign with the gifts both of peace and war, Giving rest even to great Heaven, And ensuring prosperity to thy descendants.

source: 載見辟王，曰求厥章。龍旂陽陽，和鈴央央。鞗革有鶬，休有烈光。 率見昭考，以孝以享，以介眉壽，永言保之，思皇多祜。 烈文辟公，綏以多福，俾緝熙于純嘏。
en: They appeared before their sovereign king, To seek from him the rules (they were to observe). With their dragon-emblazoned banners, flying bright, The bells on them and their front-boards tinkling, And with the rings on the ends of the reins glittering, Admirable was their majesty and splendour. He led them to appear before his father shrined on the left, Where he discharged his filial duty, and presented his offerings;— That he might have granted to him long life, And ever preserve (his dignity). Great and many are his blessings. They are the brilliant and accomplished princes, Who cheer him with his many sources of happiness, ​Enabling him to perpetuate them in their brightness as pure blessing.

source: 有客有客，亦白其馬。有萋有且，敦琢其旅。
en: The noble visitor! The noble visitor! Drawn, like his ancestors, by white horses! The reverent and dignified, Polished members of his suite!

source: 有客宿宿，有客信信。言授之縶，以縶其馬。
en: The noble guest will stay (but) a night or two! The noble guest will stay (but) two nights or four! Give him ropes, To bind his horses.

source: 薄言追之，左右綏之。既有淫威，降福孔夷。
en: I will convoy him (with a parting feast); I will comfort him in every possible way. Adorned with such great dignity, It is very natural that he should be blessed.

source: 於皇武王，無競維烈。 允文文王，克開厥後。 嗣武受之。勝殷遏劉，耆定爾功。
en: Oh! great wast thou, O king Wû, Displaying the utmost strength in thy work. Truly accomplished was king Wăn, Opening the path for his successors. Thou didst receive the inheritance from him. Thou didst vanquish Yin, and put a stop to its cruelties;— Effecting the firm establishment of thy merit.

source: 閔予小子，遭家不造，嬛嬛在疚。 於乎皇考，永世克孝，念茲皇祖，陟降庭止。 維予小子，夙夜敬止。 於乎皇王，繼序思不忘。
en: Alas for me, who am a little child, On whom has devolved the unsettled state! Solitary am I and full of distress. Oh! my great Father, All thy life long, thou wast filial. Thou didst think of my great grandfather, (Seeing ​him, as it were) ascending and descending in the court, I, the little child, Day and night will be as reverent. Oh! ye great kings, As your successor, I will strive not to forget you.

source: 訪予落止，率時昭考。 於乎悠哉！朕未有艾。將予就之，繼猶判渙。 維予小子，未堪家多難。紹庭上下，陟降厥家。 休矣皇考！以保明其身。
en: I take counsel at the beginning of my (rule), How I can follow (the example of) my shrined father. Ah! far-reaching (were his plans), And I am not yet able to carry them out. However I endeavour to reach to them, My continuation of them will still be all-deflected. I am a little child, Unequal to the many difficulties of the state. Having taken his place, (I will look for him) to go up and come down in the court, To ascend and descend in the house. Admirable art thou, O great Father, (Condescend) to preserve and enlighten me.

source: 敬之敬之，天維顯思。 命不易哉！無曰高高在上。 陟降厥士，日監在茲。
en: Let me be reverent! Let me be reverent! (The way of) Heaven is evident, And its appointment ​is not easily preserved. Let me not say that it is high aloft above me. It ascends and descends about our doings; It daily inspects us wherever we are.

source: 維予小子，不聦敬止？ 日就月將，學有緝熙于光明。 佛時仔肩，示我顯德行。
en: I am a little child, Without intelligence to be reverently (attentive to my duties); But by daily progress and monthly advance, I will learn to hold fast the gleams (of knowledge), till I arrive at bright intelligence. Assist me to bear the burden (of my position), And show me how to display a virtuous conduct.

source: 予其懲，而毖後患。莫予荓蜂，自求辛螫。 肇允彼桃蟲，拚飛維鳥。未堪家多難，予又集于蓼。
en: I condemn myself (for the past), And will be on my guard against future calamity. I will have nothing to do with a wasp, To seek for myself its painful sting. At first indeed it seemed to be ​(but) a wren, But it took wing, and became a large bird. I am unequal to the many difficulties of the kingdom, And am placed in the midst of bitter experiences.

source: 載芟載柞，其耕澤澤。千耦其耘，徂隰徂畛。 侯主侯伯，侯亞侯旅，侯彊侯以。 有嗿其饁，思媚其婦，有依其士。 有略其耜，俶載南畝，播厥百穀，實函斯活。
en: They clear away the grass and the bushes; And the ground is laid open by their ploughs.

source: 驛驛其達，有厭其傑。厭厭其苗，緜緜其麃。 載穫濟濟，有實其積，萬億及秭。 為酒為醴，烝畀祖妣，以洽百禮，有飶其香，邦家之光。 有椒其馨，胡考之寧。匪且有且，匪今斯今，振古如茲。
en: In thousands of pairs they remove the roots, Some in the low wet land, some along the dykes.

source: 畟畟良耜，俶載南畝，播厥百穀，實函斯活。 或來瞻女，載筐及筥。其饟伊黍，其笠伊糾。 其鎛斯趙，以薅荼蓼，荼蓼朽止，黍稷茂止。
en: Very sharp are the excellent shares, With which they set to work on the south-lying acres.

source: 穫之挃挃，積之栗栗，其崇如墉，其比如櫛，以開百室。 百室盈止，婦子寧止。殺時犉牡，有捄其角。 以似以續，續古之人。
en: They sow their various kinds of grain, Each seed containing in it a germ of life.

source: 絲衣其紑，載弁俅俅。自堂徂基，自羊徂牛。 鼐鼎及鼒，兕觥其觩。旨酒思柔。不吳不敖，胡考之休。
en: In his silken robes, clean and bright, With his cap on his head, looking so respectful, From the hall he goes to the foot of the stairs, And (then) from the sheep to the oxen. (He inspects) the tripods, large and small, And the curved goblet of rhinoceros horn. The good spirits are mild, (But) there is no noise, no insolence:— An auspice (this) of great longevity.

source: 於鑠王師，遵養時晦。時純熙矣，是用大介。 我龍受之，蹻蹻王之造。載用有嗣，實維爾公。 允師。
en: Oh! powerful was the king's army, But he nursed it, in obedience to circumstances, while the ​time was yet dark. When the time was clearly bright, He thereupon donned his grand armour. We have been favoured to receive What the martial king accomplished. To deal aright with what we have inherited, We have to be sincere imitators of thy course, (O king).

source: 綏萬邦，婁豐年，天命匪解。 桓桓武王，保有厥士，于以四方。克定厥家。 於昭于天，皇以間之。
en: There is peace throughout our myriad regions. There has been a succession of plentiful years:— Heaven does not weary in its favour. The martial king Wû Maintained (the confidence of) his officers, And employed them all over the kingdom, So securing the establishment of his family. Oh! glorious was he in the sight of Heaven, Which kinged him in the room (of Shang).

source: 文王既勤止，我應受之。敷時繹思，我徂維求定。 時周之命，於繹思。
en: King Wăn laboured earnestly:— Right is it we should have received (the kingdom). We will diffuse (his virtue), ever cherishing the thought of ​him; Henceforth we will seek only the settlement (of the kingdom). It was he through whom came the appointment of Kâu. Oh! let us ever cherish the thought of him.

source: 於皇時周，陟其高山。嶞山喬嶽，允猶翕河。 敷天之下，裒時之對，時周之命。
en: Oh! great now is Kâu. We ascend the high hills, Both those that are long and narrow, and the lofty mountains. Yes, and (we travel) along the regulated Ho, All under the sky, Assembling those who now respond to me. Thus it is that the appointment belongs to Kâu.

source: 思樂泮水，薄采其芹。魯侯戾止，言觀其旂。 其旂茷茷，鸞聲噦噦。無小無大，從公于邁。
en: 1. Pleasant is the semicircular water, And we gather the cress about it. The marquis of Lû is coming to it, And we see his dragon-figured banner. His banner waves in the wind, And the bells of his horses tinkle harmoniously. Small and great, All follow the prince in his progress to it.

source: 思樂泮水，薄采其藻。魯侯戾止，其馬蹻蹻。 其馬蹻蹻，其音昭昭。載色載笑，匪怒伊教。
en: 2. Pleasant is the semicircular water, And we gather the pondweed in it. The marquis of Lû has come to it, With his horses so stately. His horses are grand; His fame is brilliant. Blandly he looks and smiles; Without any impatience he delivers his instructions.

source: 思樂泮水，薄采其茆。魯侯戾止，在泮飲酒。 既飲旨酒，永錫難老。順彼長道，屈此羣醜。
en: 3. Pleasant is the semicircular water, And we gather the mallows about it. The marquis of Lû has come to it, And in the college he is drinking. He is drinking the good spirits. May there be ​given to him such old age as is seldom enjoyed! May he accord with the grand ways, So subduing to himself all the people!

source: 穆穆魯侯，敬明其德。敬慎威儀，維民之則。 允文允武，昭假烈祖。靡有不孝，自求伊祜。
en: 4. Very admirable is the marquis of Lû, Reverently displaying his virtue, And reverently watching over his deportment, The pattern of the people. With great qualities, both civil and martial, Brilliantly he affects his meritorious ancestors. In everything entirely filial, He seeks the blessing that is sure to follow.

source: 明明魯侯，克明其德。既作泮宮，淮夷攸服。 矯矯虎臣，在泮獻馘。淑問如臯陶，在泮獻囚。
en: 5. Very intelligent is the marquis of Lû, Making his virtue illustrious. He has made this college with its semicircle of water, And the tribes of the Hwâi will submit to him. His martial-looking tiger-leaders Will here present the left ears (of their foes). His examiners, wise as Kâo-yâo, Will here present the prisoners.

source: 濟濟多士，克廣德心。桓桓于征，狄彼東南。 烝烝皇皇，不吳不揚。不告于訩，在泮獻功。
en: 6. His numerous officers, Men who have enlarged their virtuous minds, With martial energy conducting their expedition, Will drive far away those tribes of the east and south. Vigorous and ​grand, Without noise or display, Without appeal to the judges, They will here present (the proofs of) their merit.

source: 角弓其觩，束矢其搜。戎車孔博，徒御無斁。 既克淮夷，孔淑不逆。式固爾猶，淮夷卒獲。
en: 7. How they draw their bows adorned with bone! How their arrows whiz forth! Their war chariots are very large! Their footmen and charioteers never weary! They have subdued the tribes of Hwâi, And brought them to an unrebellious submission. Only lay your plans securely, And all the tribes of the Hwâi will be won.

source: 翩彼飛鴞，集于泮林。食我桑黮，懷我好音。 憬彼淮夷，來獻其琛。元龜象齒，大賂南金。
en: 8. They come flying on the wing, those owls, And settle on the trees about the college; They eat the fruit of our mulberry trees, And salute us with fine notes. So awakened shall be those tribes of the Hwâi. They will come presenting their precious things, Their large tortoises, and their elephants' teeth, And great contributions of the southern metals.

source: 閟宮有侐，實實枚枚。 赫赫姜嫄，其德不回。 上帝是依，無災無害，彌月不遲。 是生后稷，降之百福。 黍稷重穋，稙稺菽麥。 奄有下國，俾民稼穡。 有稷有黍，有稻有秬。 奄有下土，纘禹之緒。 后稷之孫，實維大王。 居岐之陽，實始翦商。 至于文武，纘大王之緒。 致天之屆，于牧之野。 無貳無虞，上帝臨女！ 敦商之旅，克咸厥功。 王曰叔父： 建爾元子，俾侯于魯。 大啓爾宇，爲周室輔。 乃命魯公，俾侯于東。 錫之山川，土田附庸。 周公之孫，莊公之子。 龍旂承祀，六轡耳耳。 春秋匪解，享祀不忒。 皇皇后帝，皇祖后稷。 享以騂犧，是饗是宜，降福既多。 周公皇祖，亦其福女。 秋而載嘗，夏而楅衡。 白牡騂剛，犧尊將將。 毛炰胾羹，籩豆大房。 萬舞洋洋，孝孫有慶。 俾爾熾而昌，俾爾壽而臧。 保彼東方，魯邦是常。 不虧不崩，不震不騰。 三壽作朋，如岡如陵。 公車千乘，朱英綠縢，二矛重弓。 公徒三萬，貝冑朱綅，烝徒增增。 戎狄是膺，荊舒是懲，則莫我敢承。 俾爾昌而熾，俾爾壽而富。 黃髮台背，壽胥與試。 俾爾昌而大，俾爾耆而艾。 萬有千歲，眉壽無有害。 泰山巖巖，魯邦所詹。 奄有龜蒙，遂荒大東。 至于海邦，淮夷來同。 莫不率從，魯侯之功。 保有鳧繹，遂荒徐宅。 至于海邦，淮夷蠻貊。 及彼南夷，莫不來格。 莫敢不諾，魯侯是若。 天錫公純嘏，眉壽保魯。 居常與許，復周公之宇。 魯侯燕喜，令妻壽母。 宜大夫庶士，邦國是有。 既多受祉，黃髮齯齒。 徂來之松，新甫之柏。 是斷是度，是尋是尺。 松桷有舄，路寢孔碩。 新廟奕奕，奚斯所作。 孔曼且碩，萬民是若。
en: 1. How pure and still are the solemn temples, In their strong solidity and minute completeness! Highly distinguished was Kiang Yüan, Of virtue undeflected. God regarded her with favour, And without injury or hurt, Immediately, when her months were completed, She gave birth to Hâu-kî! On him were conferred all blessings,— (To know) how the (ordinary) millet ripened early, and the sacrificial millet late; How first to sow pulse ​and then wheat. Anon he was invested with an inferior state, And taught the people how to sow and to reap, The (ordinary) millet and the sacrificial, Rice and the black millet; Ere long over the whole country:— (Thus) continuing the work of Yü. 2. Among the descendants of Hâu-kî, There was king Thâi, Dwelling on the south of (mount) Khî, Where the clipping of Shang began. In process of time Wăn and Wû Continued the work of king Thâi, And (the purpose of) Heaven was carried out in its time, In the plain of Mû. 'Have no doubts, no anxieties,' (it was said), 'God is with you,' Wû disposed of the troops of Shang; He and his men equally shared in the achievement. (Then) king (Khăng) said, 'My uncle, I will set up your eldest son, And make him marquis of Lû. I will greatly enlarge your territory there, To be a help and support to the House of Kâu.' 3. Accordingly he appointed (our first) duke of Lû, And made him marquis in the east, Giving him the hills and rivers, The lands and fields, and the attached states. The (present) descendant of the duke of Kâu, The son of duke Kwang, With dragon-emblazoned banner, attends the sacrifices, (Grasping) his six reins soft and pliant. In spring ​and autumn he is not remiss; His offerings are all without error. To the great and sovereign God, And to his great ancestor Hâu-kî, He offers the victims, red and pure. They enjoy, they approve, And bestow blessings in large number. The duke of Kâu, and (your other) great ancestors, Also bless you. 4. In autumn comes the sacrifice of the season, But the bulls for it have had their horns capped in summer; They are the white bull and the red one. (There are) the bull-figured goblet in its dignity; Roast pig, minced meat, and soups; The dishes of bamboo and wood, and the large stands, And the dancers all complete. The filial descendant ​will be blessed. (Your ancestors) will make you gloriously prosperous, They will make you long-lived and good, To preserve this eastern region, Long possessing the state of Lû, Unwaning, unfallen, Unshaken, undisturbed! They will make your friendship with your three aged (ministers) Like the hills, like the mountains. 5. Our prince's chariots are a thousand, And (in each) are (the two spears with their) vermilion tassels, and (the two bows with their) green bands. His footmen are thirty thousand, With shells on vermilion strings adorning their helmets. So numerous are his ardent followers, To deal with the tribes of the west and north, And to punish those of King and Shû, So that none of them will dare to withstand us. (The spirits of your ancestors) shall make you grandly prosperous; They ​shall make you long-lived and wealthy. The hoary hair and wrinkled back, Marking the aged men, shall always be in your service. They shall grant you old age, ever vigorous, For myriads and thousands of years, With the eyebrows of longevity, and ever unharmed. 6. The mountain of Thâi is lofty, Looked up to by the state of Lû. We grandly possess also Kwei and Măng; And we shall extend to the limits of the east, Even the states along the sea. The tribes of the Hwâi will seek our allegiance; All will proffer their allegiance:— Such shall be the achievements of the marquis of Lû. 7. He shall maintain the possession of Hû and Yî, And extend his sway to the regions of Hsü, Even to the states along the sea. The tribes of the Hwâi, the Man, and the Mo, And those tribes (still more) to the south, All will proffer their allegiance;— Not one will dare not to answer to his call, Thus showing their obedience to the marquis of Lû. 8. Heaven will give great blessing to our prince, So that with the eyebrows of longevity he shall ​maintain Lû. He shall possess Kang and Hsü, And recover all the territory of the duke of Kâu. Then shall the marquis of Lû feast and be glad, With his admirable wife and aged mother; With his excellent ministers and all his (other) officers. Our region and state shall he hold, Thus receiving many blessings, To hoary hair, and with teeth ever renewed like a child's. 9. The pines of Zû-lâi, And the cypresses of Hsin-fû, Were cut down and measured, With the cubit line and the eight cubits' line. The projecting beams of pine were made very large; The grand inner apartments rose vast. Splendid look the new temples, The work of Hsî-sze, Very wide and large, Answering to the expectations of all the people.

source: 猗與那與，置我鞉鼓。奏鼓簡簡，衎我烈祖。湯孫奏假，綏我思成。 鞉鼓淵淵，嘒嘒管聲，既和且平，依我磬聲。 於赫湯孫，穆穆厥聲，庸鼓有斁，萬舞有奕。 我有嘉客，亦不夷懌。自古在昔，先民有作。 溫恭朝夕，執事有恪。顧予烝嘗，湯孫之將。 猗與，歎美之言也。衎，樂也。綏，安也。斁，斁然，盛也。奕，次序也。
en: How admirable! how complete! Here are set our hand-drums and drums. The drums resound harmonious and loud, To delight our meritorious ancestor. The descendant of Thang invites him with this music, That he may soothe us with the realization of our thoughts. Deep is the sound of our ​hand-drums and drums; Shrilly sound the flutes; All harmonious and blending together, According to the notes of the sonorous gem. Oh! majestic is the descendant of Thang; Very admirable is his music. The large bells and drums fill the ear; The various dances are grandly performed. We have the admirable visitors, Who are pleased and delighted. From of old, before our time, The former men set us the example;— How to be mild and humble from morning to night, And to be reverent in discharging the service. May he regard our sacrifices of winter and autumn, (Thus) offered by the descendant of Thang!

source: 猗嗟嗟烈祖，有秩斯祜。申錫無疆，及爾斯所。既載清酤，賚我思成。
en: Ah! ah! our meritorious ancestor! Permanent are the blessings coming from him, Repeatedly conferred without end;— They have come to you in this place.

source: 亦有和羹，既戒既平。鬷假無言，時靡有爭。綏我眉壽，黃耇無疆。
en: The clear spirits are in our vessels, And there is granted to us the realization of our thoughts. There are also the well-tempered soups, Prepared beforehand, with the ingredients rightly proportioned. By these offerings we invite his presence, without a word, Without (unseemly) contention (among the worshippers). He will bless us with the eyebrows of longevity, With the grey hair and wrinkled face in unlimited degree.
